# Gather

In [27]:
import pandas as pd
import numpy as np

In [2]:
patients = pd.read_csv('patients.csv')
treatments = pd.read_csv('treatments.csv')
adverse_reactions = pd.read_csv('adverse_reactions.csv')

# Assess

In [3]:
patients.head()

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,951-719-9170ZoeWellish@superrito.com,7/10/1976,121.7,66,19.6
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,PamelaSHill@cuvox.de+1 (217) 569-3204,4/3/1967,118.8,66,19.2
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,402-363-6804JaeMDebord@gustr.com,2/19/1980,177.8,71,24.8
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,7095.0,United States,PhanBaLiem@jourrapide.com+1 (732) 636-8246,7/26/1951,220.9,70,31.7
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,334-515-7487TimNeudorf@cuvox.de,2/18/1928,192.3,27,26.1

In [4]:
treatments.head()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32

In [5]:
adverse_reactions.head()

  given_name     surname           adverse_reaction
0      berta  napolitani  injection site discomfort
1       lena        baer               hypoglycemia
2     joseph         day               hypoglycemia
3     flavia  fiorentino                      cough
4    manouck     wubbels          throat irritation

### Quality

##### `patients` table: 
- Zip code is a float not a string
- Zip code has four digits sometimes
- Tim Neudorf height is 27 in instead of 72 in
- Full state name sometimes, abbreviations other times
- Dsavid Gustafsson
- Missing demographic information (adress - contact column)
- Erroneous Datatypes (assigned sex, state, zipcode and birthday columns)
- Multiple phone formats
- Default John Doe Data
- Jake Jakobson, Gerstsen and Taylor duplicated
- 48.8 is KG, not LBS

##### `treatments` table: 
- Missing hba1c changes
- The letter `u` in starting and ending doses for Auralin and Novodra
- Lower case `given_name` and `surname`
- Missing records (280 instead of 350)
- Erroneous Datatypes (Auralin and Novodra Columns)
- Inaccurate hbA1c changes (4s mistaken as 9s)
- Nulls represented as dashes (-) in auralin and novodra

##### `adverse_reactions` table: 
- Lower case `given_name` and `surname`

### Tidiness

##### `patients` table: 
- Contact column should be split into phone number and email

##### `treatments` table: 
- Three variables in two columns (Auralin and Novodra instead of Treatment, start_dose and end_dose)
- Given name and surname columns in `patients` table duplicated in `treatments` and `adverse_reactions` tables  and Lowercase given names and surnames

##### `adverse_reactions` table: 
- Adverse reactions should be part of treatments table

# Clean

In [6]:
patients_clean = patients.copy()
treatments_clean = treatments.copy()
adverse_reactions_clean = adverse_reactions.copy()

## Missing data

##### `treatments`: Missing records (280 instead of 350)

#### Define
Import `treatments_cut` into a DataFrame and concatenate it with the original `treatments` DataFrame

#### Code

In [7]:
treatments_cut = pd.read_csv('treatments_cut.csv')
treatments_clean = pd.concat([treatments_clean, treatments_cut],
                            ignore_index=True)

#### Test

In [8]:
treatments_clean.head()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32

In [9]:
treatments_clean.tail()

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
345,rovzan,kishiev,32u - 37u,-,7.75,7.41,0.34
346,jakob,jakobsen,-,28u - 26u,7.96,7.51,0.95
347,bernd,schneider,48u - 56u,-,7.74,7.44,0.30
348,berta,napolitani,-,42u - 44u,7.68,7.21,NaN
349,armina,sauvé,36u - 46u,-,7.86,7.40,NaN


##### `treatments`: Missing HbA1c changes and Inaccurate HbA1c changes (leading 4s mistaken as 9s)

#### Define
Recalculate the `hba1c_change` column: `hba1c_start` minus `hba1c_end`.

#### Code

In [10]:
treatments_clean.hba1c_change = (treatments_clean.hba1c_start - treatments_clean.hba1c_end)

#### Test

In [11]:
treatments_clean.hba1c_change.head()

0    0.43
1    0.47
2    0.43
3    0.35
4    0.32
Name: hba1c_change, dtype: float64

## Tidiness

##### Contact column in `patients` table contains two variables: phone number and email

#### Define

Extract the phone number and the email from the contact column using regular expressions and pandas' `str.extract` method. Drop the column when done.

#### Code

In [12]:
patients_clean['phone_number'] = patients_clean.contact.str.extract('((?:\+\d{1,2}\s)?\(?\d{3}\)?[\s.-]?\d{3}[\s.-]?\d{4})', expand=True)

# [a-zA-Z] to signify emails in this dataset all start and end with letters
patients_clean['email'] = patients_clean.contact.str.extract('([a-zA-Z][a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+[a-zA-Z])', expand=True)

# To drop the column contact

patients_clean = patients_clean.drop('contact', axis=1)

#### Test

In [14]:
# Confirm contact column is gone
list(patients_clean)

['patient_id',
 'assigned_sex',
 'given_name',
 'surname',
 'address',
 'city',
 'state',
 'zip_code',
 'country',
 'birthdate',
 'weight',
 'height',
 'bmi',
 'phone_number',
 'email']

In [16]:
patients_clean.phone_number.sample(5)

239         228-378-1355
63          619-299-1495
46          724-419-3583
157         920-849-0384
80     +1 (646) 621-0640
Name: phone_number, dtype: object

##### Three variables in two columns in `treatments` table (treatment, start dose and end dose)

#### Define

Melt the `auralin` and `novodra` columns to a treatment and a dose column (dose will still contain both start and end dose at this point). Then split the dose column on '-'to obtain `start_dose` and `end_dose` columns. Drop the intermediate dose columns

#### Code

In [18]:
treatments_clean = pd.melt(treatments_clean, id_vars=['given_name', 'surname', 'hba1c_start', 'hba1c_end', 'hba1c_change'], 
                                            var_name='treatment', value_name='dose')
treatments_clean = treatments_clean[treatments_clean.dose !='-']
treatments_clean['dose_start'], treatments_clean['dose_end'] = treatments_clean['dose'].str.split(' - ', 1).str
treatments_clean = treatments_clean.drop('dose', axis=1)

#### Test

In [19]:
treatments_clean.head()

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose_start,dose_end
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u
3,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u
6,sophia,haugen,7.65,7.27,0.38,auralin,37u,42u
7,eddie,archer,7.89,7.55,0.34,auralin,31u,38u
9,asia,woźniak,7.76,7.37,0.39,auralin,30u,36u

##### Adverse reaction should be part of the `treatments` table

#### Define

Merge the adverse_reaction column to the `treatments` table, joining on given name and surname

#### Code

In [20]:
treatments_clean = pd.merge(treatments_clean, adverse_reactions_clean, 
                           on=['given_name', 'surname'], how='left')

#### Test

In [21]:
treatments_clean.head()

,given_name,surname,hba1c_start,hba1c_end,hba1c_change,treatment,dose_start,dose_end,adverse_reaction
0,veronika,jindrová,7.63,7.20,0.43,auralin,41u,48u,NaN
1,skye,gormanston,7.97,7.62,0.35,auralin,33u,36u,NaN
2,sophia,haugen,7.65,7.27,0.38,auralin,37u,42u,NaN
3,eddie,archer,7.89,7.55,0.34,auralin,31u,38u,NaN
4,asia,woźniak,7.76,7.37,0.39,auralin,30u,36u,NaN

##### Given name and surname columns in `patients` table duplicated in `treatments` and `adverse_reactions` tables  and Lowercase given names and surnames

#### Define

Adverse reactions table is no longer needed so ignore that part. Isolate the patient ID and names in the `patients`table, then convert these names to lower case to join with `treatments`. Then drop the given name and surname columns in the treatments table (So these being lowercase isn't an issue anymore)

#### Code

In [23]:
id_names = patients_clean[['patient_id', 'given_name', 'surname']]
id_names.given_name = id_name.given_name.str.lower()
id_names.surname = id_names.surname.str.lower()
treatments_clean = pd.merge(treatments_clean, id_names, on=['given_name', 'surname'])
treatments_clean = treatments_clean.drop(['given_name', 'surname'], axis=1)

/anaconda3/lib/python3.6/site-packages/pandas/core/generic.py:4401: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

#### Test

In [24]:
treatments_clean.head()

,hba1c_start,hba1c_end,hba1c_change,treatment,dose_start,dose_end,adverse_reaction,patient_id
0,7.63,7.20,0.43,auralin,41u,48u,NaN,225
1,7.97,7.62,0.35,auralin,33u,36u,NaN,242
2,7.65,7.27,0.38,auralin,37u,42u,NaN,345
3,7.89,7.55,0.34,auralin,31u,38u,NaN,276
4,7.76,7.37,0.39,auralin,30u,36u,NaN,15

In [25]:
# Patient ID should be the only duplicate column

all_columns = pd.Series(list(patients_clean) + list(treatments_clean))
all_columns[all_columns.duplicated()]

22    patient_id
dtype: object

## Quality

##### Zipcode is a float, not a string and have four digits sometimes

#### Define

Convert the zip code column's datatype from a float to string, using `astype`, remove '.0' using string slicing and pad four digits zip codes with a leading 0.

#### Code

In [29]:
patients_clean['zip_code'] = patients_clean.zip_code.astype(str).str[:-2].str.pad(5, fillchar='0')

patients_clean.zip_code = patients_clean.zip_code.replace('0000n', np.nan)

#### Test

In [30]:
patients_clean.zip_code.head()

0    92390
1    61812
2    68467
3    07095
4    36303
Name: zip_code, dtype: object

##### Tim Neudorf height is 27 in instead of 72 in

#### Define

Replace height for rows in the patients table that have a height of 27 in (there is only one) with 72 in.

#### Code

In [33]:
patients_clean.height = patients_clean.height.replace(27, 72)

#### Test

In [35]:
# Should be empty
patients_clean[patients_clean.height == 27]

Empty DataFrame
Columns: [patient_id, assigned_sex, given_name, surname, address, city, state, zip_code, country, birthdate, weight, height, bmi, phone_number, email]
Index: []

##### Full state names sometimes, abbreviations other times

#### Define

Apply a function that converts full state name to state abbreviation for California, New York, Illinois, Florida and Nebraska.

In [37]:
state_abbrev = {'California' : 'CA',
               'New York' : 'NY',
               'Illinois': 'IL',
               'Florida' : 'FL',
               'Nebraska' : 'NE'}

# Function to apply
def abbreviate_state(patient):
    '''
        Changing the full name state to abbreviation.
        INPUT:
        patient: Patients' dataset.
        OUTPUT:
        abbrev: New states' name. Str. The output, if the conditions has been respected, will be the abbreviation of states'name.
    '''
    if patient['state'] in state_abbrev.keys():
        abbrev = state_abbrev[patient['state']]
        return abbrev
    else:
        return patient['state']
patients_clean['state'] = patients_clean.apply(abbreviate_state, axis=1)

#### Test

In [39]:
patients_clean.state.value_counts()

CA    60
NY    47
TX    32
IL    24
MA    22
FL    22
PA    18
GA    15
OH    14
MI    13
LA    13
OK    13
NJ    12
VA    11
WI    10
MS    10
IN     9
TN     9
AL     9
MN     9
NC     8
KY     8
WA     8
MO     7
NE     6
KS     6
NV     6
ID     6
IA     5
CT     5
SC     5
AZ     4
AR     4
ME     4
CO     4
ND     4
RI     4
WV     3
MD     3
SD     3
DE     3
OR     3
DC     2
MT     2
VT     2
AK     1
NM     1
WY     1
NH     1
Name: state, dtype: int64

##### Dsvid Gustafsson

#### Define

Replace given name for rows in the `patients`table that have given name of 'Dsvid' with 'David'

#### Code

In [40]:
patients_clean.given_name = patients_clean.given_name.replace('Dsvid', 'David')

#### Test

In [43]:
patients_clean[patients_clean.surname == 'Gustafsson']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone_number,email
8,9,male,David,Gustafsson,1790 Nutter Street,Kansas City,MO,64105,United States,3/6/1937,163.9,66,26.5,816-265-9578,DavidGustafsson@armyspy.com

##### Erroneous datatypes (assigned sex, state, zip_code and birthdate columns) and Erroneous datatypes (Auralin and Novodra columns) and the letter 'u' in starting and ending doeses for Auralin and Novodra

#### Define

Convert assigned sex and state to categorical data types. Zip code data type was already addressed above. Convert birthdate to datetime data type. Strip the letter 'u' in start dose and end dose and convert those columns to data type integer.

#### Code

In [47]:
# To datetime
patients_clean.birthdate = pd.to_datetime(patients_clean.birthdate)

In [ ]:
# To category
patients_clean.assigned_sex = patients_clean.assigned_sex.astype('category')
patients_clean.state = patients_clean.state.astype('category')

# Strip u and to integer
treatments_clean.dose_start = treatments_clean.dose_start.str.strip('u').astype(int)
treatments_clean.dose_end = treatments_clean.dose_end.str.strip('u').astype(int)

#### Test

In [48]:
patients_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 15 columns):
patient_id      503 non-null int64
assigned_sex    503 non-null category
given_name      503 non-null object
surname         503 non-null object
address         491 non-null object
city            491 non-null object
state           491 non-null category
zip_code        491 non-null object
country         491 non-null object
birthdate       503 non-null datetime64[ns]
weight          503 non-null float64
height          503 non-null int64
bmi             503 non-null float64
phone_number    491 non-null object
email           491 non-null object
dtypes: category(2), datetime64[ns](1), float64(2), int64(2), object(8)
memory usage: 53.9+ KB

##### Multiple phone number formats

#### Define

Strip all " ", "-", "(", ")", and "+" and store each number without any formatting. Pad the phone number with a 1 if the length of the number is 10 digits (we want country code).

#### Code

In [49]:
patients_clean.phone_number = patients_clean.phone_number.str.replace(r'\D+', '').str.pad(11, fillchar='1')

#### Test

In [51]:
patients_clean.phone_number.head()

0    19517199170
1    12175693204
2    14023636804
3    17326368246
4    13345157487
Name: phone_number, dtype: object

#### Default John Doe data

#### Define
Remove the non-recoverable John Doe records from the `patients` table.

#### Code

In [52]:
patients_clean = patients_clean[patients_clean.surname != 'Doe']

#### Test

In [53]:
# Should be no Doe records
patients_clean.surname.value_counts()

Taylor           3
Jakobsen         3
Schiavone        2
Liễu             2
Hueber           2
Collins          2
Kowalczyk        2
Correia          2
Kadyrov          2
Lâm              2
Silva            2
Tạ               2
Cindrić          2
Nilsen           2
Grímsdóttir      2
Parker           2
Souza            2
Bùi              2
Woźniak          2
Gersten          2
Cabrera          2
Johnson          2
Batukayev        2
Ogochukwu        2
Tucker           2
Dratchev         2
Aranda           2
Berg             2
Lund             2
Lương            2
                ..
﻿Dvořák          1
Gormanston       1
Ch'eng           1
Tikhonov         1
Balagić          1
Cotton           1
Luman            1
Gaber            1
Sykes            1
Reilly           1
Roy              1
Kos              1
Adams            1
Miranda          1
Tryggvadóttir    1
Sung             1
Tar              1
Svensson         1
Vesecká          1
Ghanem           1
Guðjónsdóttir    1
Mueller          1
Luwam            1
Fournier         1
Oates            1
Amari            1
van de Wiel      1
Kinfe            1
Gegič            1
Holm             1
Name: surname, Length: 465, dtype: int64

##### Multiple records for Jakobsen, Gersten, Taylor

##### Define
Remove the Jake Jakobsen, Pat Gersten, and Sandy Taylor rows from the `patients` table. These are the nicknames, which happen to also not be in the `treatments` table (removing the wrong name would create a consistency issue between the `patients` and `treatments` table). These are all the second occurrence of the duplicate. These are also the only occurences of non-null duplicate addresses.

#### Code

In [54]:
# tilde means not: http://pandas.pydata.org/pandas-docs/stable/indexing.html#boolean-indexing
patients_clean = patients_clean[~((patients_clean.address.duplicated()) & patients_clean.address.notnull())]

#### Test

In [56]:
patients_clean[patients_clean.surname == 'Jakobsen']

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,birthdate,weight,height,bmi,phone_number,email
24,25,male,Jakob,Jakobsen,648 Old Dear Lane,Port Jervis,NY,12771,United States,1985-08-01,155.8,67,24.4,18458587707,JakobCJakobsen@einrot.com
432,433,female,Karen,Jakobsen,1690 Fannie Street,Houston,TX,77020,United States,1962-11-25,185.2,67,29.0,19792030438,KarenJakobsen@jourrapide.com

##### kgs instead of lbs for Zaitseva weight

#### Define
Use [advanced indexing](https://stackoverflow.com/a/44913631) to isolate the row where the surname is Zaitseva and convert the entry in its weight field from kg to lbs.

#### Code

In [57]:
weight_kg = patients_clean.weight.min()
mask = patients_clean.surname == 'Zaitseva'
column_name = 'weight'
patients_clean.loc[mask, column_name] = weight_kg * 2.20462

#### Test

In [58]:
# 48.8 shouldn't be the lowest anymore
patients_clean.weight.sort_values()

459    102.100000
335    102.700000
74     103.200000
317    106.000000
171    106.500000
51     107.100000
210    107.585456
270    108.100000
198    108.500000
48     109.100000
478    109.600000
141    110.200000
38     111.800000
438    112.000000
14     112.000000
235    112.200000
307    112.400000
191    112.600000
408    113.100000
49     113.300000
326    114.000000
338    114.100000
253    117.000000
321    118.400000
168    118.800000
1      118.800000
350    119.000000
207    119.200000
265    120.000000
341    120.300000
          ...
332    224.000000
12     224.200000
252    224.200000
222    224.800000
166    225.300000
111    225.900000
101    226.200000
150    226.600000
88     227.700000
352    227.700000
428    227.700000
13     228.400000
339    229.000000
182    230.300000
121    230.800000
257    231.700000
395    231.900000
246    232.100000
219    237.800000
11     238.700000
50     238.900000
441    239.100000
499    239.600000
439    242.000000
487    242.400000
144    244.900000
61     244.900000
283    245.500000
118    254.500000
485    255.900000
Name: weight, Length: 494, dtype: float64